Tekla Open API Reference for Tekla Structures 2025
SymbolInfo Constructor (String, Int32)
 Creates a new symbol info instance.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public SymbolInfo(
	string SymbolFile,
	int SymbolIndex
)
Public Sub New (
	SymbolFile As String,
	SymbolIndex As Integer
)
Parameters
SymbolFile
Type: System.String
The symbol file to be used.
SymbolIndex
Type: System.Int32
The symbol index to be used.
Exceptions
Exception | Condition
ArgumentOutOfRangeException | Thrown if the symbol index is invalid.
See Also
Reference
SymbolInfo Class
SymbolInfo Overload
Tekla.Structures.Drawing Namespace